Masmiseim36/nxpSDK/boards/frdmke17z/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPIT
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLPIT(void)
{
    /* FTM0 is selected as LPIT device trigger input 0 */
    TRGMUX_SetTriggerSource(TRGMUX0, kTRGMUX_Lpit, kTRGMUX_TriggerInput0, kTRGMUX_SourceFtm0);
    /* ADC0 COCOA is selected as LPIT device trigger input 1 */
    TRGMUX_SetTriggerSource(TRGMUX0, kTRGMUX_Lpit, kTRGMUX_TriggerInput1, kTRGMUX_SourceAdc0CocoA);
    /* ADC0 COCOB is selected as LPIT device trigger input 2 */
    TRGMUX_SetTriggerSource(TRGMUX0, kTRGMUX_Lpit, kTRGMUX_TriggerInput2, kTRGMUX_SourceAdc0CocoB);
    /* ADC0 COCOC is selected as LPIT device trigger input 3 */
    TRGMUX_SetTriggerSource(TRGMUX0, kTRGMUX_Lpit, kTRGMUX_TriggerInput3, kTRGMUX_SourceAdc0CocoC);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitADC:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '31', peripheral: ADC0, signal: 'SE, 13', pin_signal: ADC0_SE13/PTD7/LPUART2_TX}
  - {pin_num: '26', peripheral: ADC0, signal: 'SE, 1', pin_signal: ACMP0_IN3/ADC0_SE1/TSI0_CH22/PTE8/FTM0_CH6}
  - {pin_num: '29', peripheral: ADC0, signal: 'SE, 7', pin_signal: ADC0_SE7/ACMP0_IN4/PTC3/FTM0_CH3/FXIO_D7}
  - {pin_num: '32', peripheral: ADC0, signal: 'SE, 11', pin_signal: ADC0_SE11/PTD6/LPUART2_RX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitADC
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitADC(void)
{
    /* Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTC3 (pin 29) is configured as ADC0_SE7 */
    PORT_SetPinMux(PORTC, 3U, kPORT_PinDisabledOrAnalog);

    /* PORTD6 (pin 32) is configured as ADC0_SE11 */
    PORT_SetPinMux(PORTD, 6U, kPORT_PinDisabledOrAnalog);

    /* PORTD7 (pin 31) is configured as ADC0_SE13 */
    PORT_SetPinMux(PORTD, 7U, kPORT_PinDisabledOrAnalog);

    /* PORTE8 (pin 26) is configured as ADC0_SE1 */
    PORT_SetPinMux(PORTE, 8U, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitTRGMUX:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {peripheral: ADC0, signal: 'TRG, A', pin_signal: LPIT0_CH0}
  - {peripheral: ADC0, signal: 'TRG, B', pin_signal: LPIT0_CH1}
  - {peripheral: ADC0, signal: 'TRG, C', pin_signal: LPIT0_CH2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitTRGMUX
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitTRGMUX(void)
{

    SIM->ADCOPT = ((SIM->ADCOPT &
                    /* Mask bits to zero which are setting */
                    (~(SIM_ADCOPT_ADC0TRGSEL_MASK | SIM_ADCOPT_ADC0PRETRGSEL_MASK)))

                   /* ADC0 trigger source select: TRGMUX output. */
                   | SIM_ADCOPT_ADC0TRGSEL(ADCOPT_ADC0TRGSEL_TRGMUX)

                   /* ADC0 pre-trigger source select: TRGMUX output. */
                   | SIM_ADCOPT_ADC0PRETRGSEL(ADCOPT_ADC0PRETRGSEL_TRGMUX));
    /* LPIT0 Channel0 is selected as ADC0 device trigger input 0 */
    TRGMUX_SetTriggerSource(TRGMUX0, kTRGMUX_Adc0, kTRGMUX_TriggerInput0, kTRGMUX_SourceLpit0Ch0);
    /* LPIT0 Channel1 is selected as ADC0 device trigger input 1 */
    TRGMUX_SetTriggerSource(TRGMUX0, kTRGMUX_Adc0, kTRGMUX_TriggerInput1, kTRGMUX_SourceLpit0Ch1);
    /* LPIT0 Channel2 is selected as ADC0 device trigger input 2 */
    TRGMUX_SetTriggerSource(TRGMUX0, kTRGMUX_Adc0, kTRGMUX_TriggerInput2, kTRGMUX_SourceLpit0Ch2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCMP:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '30', peripheral: CMP0, signal: 'IN, 5', pin_signal: ADC0_SE15/ACMP0_IN5/PTC2/FTM0_CH2/FXIO_D6}
  - {pin_num: '11', peripheral: CMP0, signal: DAC_8bit_VIN1, pin_signal: VDDA}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCMP
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCMP(void)
{
    /* Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    /* PORTC2 (pin 30) is configured as ACMP0_IN5 */
    PORT_SetPinMux(PORTC, 2U, kPORT_PinDisabledOrAnalog);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
